RIET/src/Documents/ОплатаКнигиПокупок/ОплатаКнигиПокупок.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ОплатаКнигиПокупок</name>
  <registerRecords>AccumulationRegister.НеоплаченныеОстаткиПоВаучерам</registerRecords>
  <registerRecords>AccumulationRegister.ПроводкиDSSОбщие</registerRecords>
  <registerRecords>AccumulationRegister.НДСПредъявленный</registerRecords>
  <attributes>
    <name>Reference</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>25</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВалютаДокумента</name>
    <type>
      <types>CatalogRef.Валюты</types>
    </type>
  </attributes>
  <attributes>
    <name>Company</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>4</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаПроведения</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НалоговыйПериод</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>КурсДокумента</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>4</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СуммаДокумента</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СуммаДокументаРуб</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СуммаРасхождения</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Суммы</name>
    <attributes>
      <name>Ваучер</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>10</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СуммаРуб</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

RIET/src/AccumulationRegisters/НеоплаченныеОстаткиПоВаучерам/НеоплаченныеОстаткиПоВаучерам.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>НеоплаченныеОстаткиПоВаучерам</name>
  <resources>
    <name>Сумма</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>СуммаРуб</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Ваучер</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>Валюта</name>
    <type>
      <types>CatalogRef.Валюты</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

RIET/src/AccumulationRegisters/НДСПредъявленный/НДСПредъявленный.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>НДСПредъявленный</name>
  <comment>(Регл) НДС, предъявляемый поставщиком</comment>
  <resources>
    <name>СуммаБезНДС</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>НДС</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>СуммаБезНДСВВалюте</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>НДСВВалюте</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <attributes>
    <name>НалоговыйПериод</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <dimensions>
    <name>ПодразделениеОрганизации</name>
    <type>
      <types>CatalogRef.ПодразделенияОрганизаций</types>
    </type>
  </dimensions>
  <dimensions>
    <name>СчетФактура</name>
    <type>
      <types>DocumentRef.ФормированиеЗаписейКнигиПокупок</types>
      <types>DocumentRef.ПлатежноеПоручениеВходящее</types>
      <types>DocumentRef.СчетКнигиПокупок</types>
      <types>DocumentRef.РеализацияТоваровУслуг</types>
      <types>DocumentRef.ПоступлениеТоваровУслуг</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ВидВычета</name>
    <comment>Вид вычета НДС (покупка, налоговый агент, курсовые разницы, НДС с авансов)</comment>
    <type>
      <types>EnumRef.ВидыНДСкВычету</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ВидЦенности</name>
    <type>
      <types>EnumRef.ВидыЦенностей</types>
    </type>
  </dimensions>
  <dimensions>
    <name>СтавкаНДС</name>
    <type>
      <types>EnumRef.СтавкиНДС</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Поставщик</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Валюта</name>
    <type>
      <types>CatalogRef.Валюты</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ДоговорКонтрагента</name>
    <type>
      <types>CatalogRef.ДоговорыКонтрагентов</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

RIET/src/InformationRegisters/КурсыВалют/КурсыВалют.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>КурсыВалют</name>
  <comment>(Общ)</comment>
  <informationRegisterPeriodicity>Day</informationRegisterPeriodicity>
  <resources>
    <name>Курс</name>
    <comment>(Общ)</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>4</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>Кратность</name>
    <comment>(Общ)</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Валюта</name>
    <comment>(Общ)</comment>
    <type>
      <types>CatalogRef.Валюты</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

RIET/src/Enums/МодулиРазработки/МодулиРазработки.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>МодулиРазработки</name>
  <enumValues>
    <name>FixedAssets</name>
  </enumValues>
  <enumValues>
    <name>PurchaseBook</name>
  </enumValues>
  <enumValues>
    <name>SalesBook</name>
  </enumValues>
  <enumValues>
    <name>Inventory</name>
  </enumValues>
  <enumValues>
    <name>InventoryCosts</name>
  </enumValues>
  <enumValues>
    <name>Importation</name>
  </enumValues>
  <enumValues>
    <name>GL</name>
  </enumValues>
  <enumValues>
    <name>Salary</name>
  </enumValues>
  <enumValues>
    <name>TangibleAssets</name>
  </enumValues>
</mdclass:Enum>

RIET/src/Enums/ТипыПроводокAPAP/ТипыПроводокAPAP.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ТипыПроводокAPAP</name>
  <enumValues>
    <name>CashDisbursement</name>
  </enumValues>
  <enumValues>
    <name>PaymentAccrual</name>
  </enumValues>
  <enumValues>
    <name>GainLoss</name>
  </enumValues>
</mdclass:Enum>

RIET/src/Enums/ВидыНДСкВычету/ВидыНДСкВычету.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ВидыНДСкВычету</name>
  <enumValues>
    <name>ПредъявленПоставщиком</name>
    <comment>Вычет НДС по приобретенным ценностям</comment>
  </enumValues>
  <enumValues>
    <name>АгентскийНДС</name>
    <comment>WHT</comment>
  </enumValues>
  <enumValues>
    <name>КурсовыеРазницы</name>
  </enumValues>
  <enumValues>
    <name>НДСсАвансов</name>
  </enumValues>
</mdclass:Enum>

RIET/src/Enums/ВидыЦенностей/ВидыЦенностей.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ВидыЦенностей</name>
  <comment>(Регл)</comment>
  <enumValues>
    <name>АвансыВыданные</name>
    <comment>для учета НДС, предъявленного по выданному авансу</comment>
  </enumValues>
  <enumValues>
    <name>АвансыПолученные</name>
    <comment>для учета НДС, исчисленного с полученных авансов, кроме НДС с авансов под будущие поставки с 0%</comment>
  </enumValues>
  <enumValues>
    <name>АвансыПолученные0</name>
    <comment>для учета НДС с авансов, полученных под будущие поставки с применением ставки 0%</comment>
  </enumValues>
  <enumValues>
    <name>ВнутреннеПотребление</name>
    <comment>Ценности (товары, работы или услуги, переданные для собственного потребления внутри организации)</comment>
  </enumValues>
  <enumValues>
    <name>Возврат</name>
    <comment>для учета НДС, по возвращаемым от покупателя (поставщику) ценностям</comment>
  </enumValues>
  <enumValues>
    <name>ИмуществоСУчетомНДС</name>
    <comment>Имущество, в балансовую стоимость которого входит НДС, уплаченный ранее поставщикам данного имущества</comment>
  </enumValues>
  <enumValues>
    <name>КомандировочныеРасходы</name>
    <comment>для отражения НДС по командировочным расходам</comment>
  </enumValues>
  <enumValues>
    <name>Материалы</name>
  </enumValues>
  <enumValues>
    <name>НалоговыйАгентАренда</name>
    <comment>для учета сумм НДС, удержанных при аренде имущества у государственных и муниципальных органов</comment>
  </enumValues>
  <enumValues>
    <name>НалоговыйАгентРеализацияИмущества</name>
    <comment>для учета сумм НДС, удержанных при приобретении государственного и муниципального имущества</comment>
  </enumValues>
  <enumValues>
    <name>НалоговыйАгентИностранцы</name>
    <comment>для учета сумм НДС, удержанных с иностранцев, не состоящих на налоговом учете в РФ</comment>
  </enumValues>
  <enumValues>
    <name>НалоговыйАгентКомитент</name>
  </enumValues>
  <enumValues>
    <name>НМА</name>
  </enumValues>
  <enumValues>
    <name>Оборудование</name>
    <comment>для учета НДС по приобретаемому оборудованию требующему монтажа для ввода в эксплуатацию</comment>
  </enumValues>
  <enumValues>
    <name>ОбъектыНезавершенногоСтроительства</name>
    <comment>для учета НДС по приобретаемым (реализуемым) объектам незавершенного строительства</comment>
  </enumValues>
  <enumValues>
    <name>ОС</name>
  </enumValues>
  <enumValues>
    <name>ПосредническиеУслуги</name>
    <comment>Посреднические услуги оказываемые в интересах другого лица на основе договоров поручения, комиссии либо агентских договоров</comment>
  </enumValues>
  <enumValues>
    <name>ПредставительскиеРасходы</name>
    <comment>для учета НДС по представительским расходам</comment>
  </enumValues>
  <enumValues>
    <name>ПрочиеРаботыИУслуги</name>
  </enumValues>
  <enumValues>
    <name>СМРПодрядные</name>
    <comment>для учета НДС, предъявленных подрядчиками при выполнении строительства ОС</comment>
  </enumValues>
  <enumValues>
    <name>СМРСобственнымиСилами</name>
    <comment>для учета НДС, приходящегося на СМР, выполненные самой организацией (хозспособ)</comment>
  </enumValues>
  <enumValues>
    <name>СуммыСвязанныеСРасчетамиПоОплате</name>
    <comment>Суммы, связанные с расчетами по оплате (ст. 162 НК РФ)</comment>
  </enumValues>
  <enumValues>
    <name>ТаможенныеПлатежи</name>
    <comment>для учета НДС, уплаченного налогоплательщиком при ввозе на территорию России товаров</comment>
  </enumValues>
  <enumValues>
    <name>ТаможенныеПлатежиОС</name>
    <comment>Для учета НДС, уплаченного налогоплательщиком при ввозе на территорию России ОС и оборудования (использование с 01.01.2006)</comment>
  </enumValues>
  <enumValues>
    <name>Товары</name>
  </enumValues>
  <enumValues>
    <name>ВнутреннееПотребление</name>
  </enumValues>
  <enumValues>
    <name>ВозвратАвансовПолученных</name>
  </enumValues>
  <enumValues>
    <name>ТоварыУслугиКомитентов</name>
  </enumValues>
  <enumValues>
    <name>ТаможенныйСоюз</name>
  </enumValues>
</mdclass:Enum>

RIET/src/Enums/СтавкиНДС/СтавкиНДС.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>СтавкиНДС</name>
  <comment>(Общ)</comment>
  <enumValues>
    <name>НДС18</name>
    <comment>(Общ) Ставка НДС 18%</comment>
  </enumValues>
  <enumValues>
    <name>НДС18_118</name>
    <comment>(Общ) Расчетная ставка НДС 18% / 118%</comment>
  </enumValues>
  <enumValues>
    <name>НДС10</name>
    <comment>(Общ) Ставка НДС 10%</comment>
  </enumValues>
  <enumValues>
    <name>НДС10_110</name>
    <comment>(Общ) Расчетная ставка НДС 10% / 110%</comment>
  </enumValues>
  <enumValues>
    <name>НДС0</name>
    <comment>(Общ) Ставка НДС 0%</comment>
  </enumValues>
  <enumValues>
    <name>БезНДС</name>
    <comment>(Общ)</comment>
  </enumValues>
  <enumValues>
    <name>НДС20</name>
    <comment>(Общ) Ставка НДС 20%</comment>
  </enumValues>
  <enumValues>
    <name>НДС20_120</name>
    <comment>(Общ) Расчетная ставка НДС 20% / 120%</comment>
  </enumValues>
  <enumValues>
    <name>НДС12</name>
    <comment>(Общ) Ставка НДС 12%</comment>
  </enumValues>
</mdclass:Enum>

RIET/src/Documents/ОплатаКнигиПокупок/ObjectModule.bsl
Перем мВалютаРегламентированногоУчета Экспорт;
Перем мУдалятьДвижения;

Перем мНачалоОткрытогоУправленческогоПериода Экспорт; // Используется в обработке Формирование оплат для установки кеша
Перем мНачалоОткрытогоНалоговогоПериода Экспорт; // Используется в обработке Формирование оплат для установки кеша


////////////////////////////////////////////////////////////////////////////////
// ЗАПОЛНЕНИЕ ДОКУМЕНТА

// ДОДЕЛАТЬ!!!
Процедура ОбновитьСоставПроводокИЗаполнитьДокумент(Отказ = Ложь, Заголовок = Неопределено, МассивПроводок = Неопределено) Экспорт
		
	Если Заголовок = Неопределено Тогда
		Заголовок = "Заполнение документа """ + ЭтотОбъект + """ с Reference = " + Reference;
	КонецЕсли;
	
	Если Отказ Тогда
		Возврат;
	КонецЕсли;
			
	НачатьТранзакцию();
	НачалоДняДаты = НачалоДня(Дата);
	Если НЕ ЭтоНовый() Тогда
		
		// Отвяжем проводки, которые не должны быть привязаны к документу
		Запрос = Новый Запрос;
		Запрос.УстановитьПараметр("Ссылка", Ссылка);
		// МОЖНО СРАЗУ ВЫБИРАТЬ ТЕ ПРОВОДКИ, КОТОРЫЕ НАДО ОТВЯЗАТЬ
		Запрос.Текст =
		"ВЫБРАТЬ
		|	ПроводкаDSS.Company,
		|	ПроводкаDSS.DateLawson,
		|	ПроводкаDSS.Reference,
		|	ПроводкаDSS.ПометкаУдаления,
		|	ПроводкаDSS.Ссылка,
		|	ПроводкаDSS.Currency
		|ИЗ
		|	Документ.ПроводкаDSS КАК ПроводкаDSS
		|ГДЕ
		|	ПроводкаDSS.Документ = &Ссылка
		|
		|ДЛЯ ИЗМЕНЕНИЯ
		|	Документ.ПроводкаDSS";
		
		Результат = Запрос.Выполнить();
		Если НЕ Результат.Пустой() Тогда
			
			Выборка = Результат.Выбрать();
			ПустаяСсылка = Документы.ОплатаКнигиПокупок.ПустаяСсылка();
			Пока Выборка.Следующий() Цикл
				
				ОтвязатьПроводку = Выборка.ПометкаУдаления
				ИЛИ СокрЛП(Выборка.Reference) <> СокрЛП(Reference)
				ИЛИ Выборка.Company <> Company 
				ИЛИ Выборка.DateLawson <> НачалоДняДаты
				ИЛИ Выборка.Currency <> ВалютаДокумента;
				
				Если ОтвязатьПроводку Тогда
					
					ДокументОбъект = Выборка.Ссылка.ПолучитьОбъект();
					ДокументОбъект.Документ = ПустаяСсылка;
					Попытка
						ДокументОбъект.Записать(РежимЗаписиДокумента.Запись);
					Исключение
						ТекстОшибки = "Не удалось записать элемент справочника ""Проводки DSS оплат книги покупок"" """ + ДокументОбъект + """: " + ОписаниеОшибки();
						ОбщегоНазначения.СообщитьОбОшибке(ТекстОшибки, Отказ, Заголовок);
						ОтменитьТранзакцию();
						Возврат;
					КонецПопытки;
					
				КонецЕсли;
				
			КонецЦикла; // Пока Выборка.Следующий()
			
		КонецЕсли; // Если НЕ Результат.Пустой()		
		
		// Если документ еще не записан - запишем его
	Иначе 
		
		Попытка
			Записать(РежимЗаписиДокумента.Запись);
		Исключение
			ТекстОшибки = "Не удалось записать документ """ + ЭтотОбъект + """ с Reference = " + Reference + ": " + ОписаниеОшибки();
			ОбщегоНазначения.СообщитьОбОшибке(ТекстОшибки, Отказ, Заголовок);
			ОтменитьТранзакцию();
			Возврат;
		КонецПопытки;
	КонецЕсли; // Если НЕ ЭтоНовый()
	
	Если МассивПроводок = Неопределено Тогда		
		// Найдем проводки, которые можно привязать к документу
		Запрос = Новый Запрос;
		Запрос.УстановитьПараметр("Reference", Reference);
		Запрос.УстановитьПараметр("DateLawson", НачалоДняДаты);
		Запрос.УстановитьПараметр("Currency", ВалютаДокумента);
		Запрос.УстановитьПараметр("Company", Company);	
		
		Запрос.Текст =
		"ВЫБРАТЬ
		|	ПроводкаDSS.Ссылка
		|ИЗ
		|	Документ.ПроводкаDSS КАК ПроводкаDSS
		|ГДЕ
		|   ПроводкаDSS.System = ""AP""
		|	И ПроводкаDSS.Reference = &Reference
		|	И ПроводкаDSS.DateLawson = &DateLawson
		|	И ПроводкаDSS.Currency = &Currency
		|	И ПроводкаDSS.Company = &Company
		|	И ПроводкаDSS.Модуль = ЗНАЧЕНИЕ(Перечисление.МодулиРазработки.PurchaseBook)
		|	И (ПроводкаDSS.SourceCode = ""AP""
		|			ИЛИ ПроводкаDSS.SourceCode = ""VP"")
		|	И НЕ ПроводкаDSS.Документ ССЫЛКА Документ.ОплатаКнигиПокупок
		|	И (ПроводкаDSS.ТипПроводки = ЗНАЧЕНИЕ(Перечисление.ТипыПроводокAPAP.CashDisbursement)
		|			ИЛИ ПроводкаDSS.ТипПроводки = ЗНАЧЕНИЕ(Перечисление.ТипыПроводокAPAP.PaymentAccrual))
		|	И (НЕ ПроводкаDSS.ПометкаУдаления)
		|
		|ДЛЯ ИЗМЕНЕНИЯ
		|	Документ.ПроводкаDSS";
		
		Результат = Запрос.Выполнить();
		Если НЕ Результат.Пустой() Тогда
			
			// Привяжем проводки к документу, при этом перезаполнится ТЧ
			МассивПроводок = Результат.Выгрузить().ВыгрузитьКолонку("Ссылка");
			МеханизмыКнигиПокупок.ПереброситьПроводкиКнигиПокупокНаДокумент(МассивПроводок, ЭтотОбъект, Отказ, Заголовок);
			
		Иначе     		
			ЗаполнитьТЧСуммыПоПривязаннымПроводкам(Отказ, Заголовок);
			
		КонецЕсли;
		
	Иначе
		МеханизмыКнигиПокупок.ПереброситьПроводкиКнигиПокупокНаДокумент(МассивПроводок, ЭтотОбъект, Отказ, Заголовок);
	КонецЕсли;
	
	Если Отказ Тогда
		ОтменитьТранзакцию();
		Возврат;
	КонецЕсли;
	
	ЗафиксироватьТранзакцию();
	
	ЗаполнитьШапкуДокументаПоПривязаннымПроводкам(, Заголовок);
	
КонецПроцедуры

//ДОДЕЛАТЬ!!!
Процедура ЗаполнитьШапкуДокументаПоПривязаннымПроводкам(Отказ = Ложь, Заголовок = Неопределено) Экспорт
	
	Если Заголовок = Неопределено Тогда
		Заголовок = "Заполнение шапки документа """ + ЭтотОбъект + """ с Reference = " + Reference;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	ПроводкаDSS.Company,
		|	ПроводкаDSS.DateLawson,
		|	ПроводкаDSS.Reference,
		|	ПроводкаDSS.Currency
		|ИЗ
		|	Документ.ПроводкаDSS КАК ПроводкаDSS
		|ГДЕ
		|	ПроводкаDSS.Документ = &Ссылка
		|	И (НЕ ПроводкаDSS.ПометкаУдаления)
		|	И (ПроводкаDSS.ТипПроводки = ЗНАЧЕНИЕ(Перечисление.ТипыПроводокAPAP.CashDisbursement)
		|			ИЛИ ПроводкаDSS.ТипПроводки = ЗНАЧЕНИЕ(Перечисление.ТипыПроводокAPAP.PaymentAccrual))";
		
	Результат = Запрос.Выполнить();
	
	Если Результат.Пустой() Тогда
		
		ОбщегоНазначения.СообщитьОбОшибке("К документу не привязано ни одной проводки, по которой можно заполнить шапку!
			|Шапка документа заполнена не будет!", Отказ, Заголовок);
		Возврат;
			
	Иначе
		
		Выборка = Результат.Выбрать();
		Если Выборка.Количество() > 1 Тогда
			ОбщегоНазначения.СообщитьОбОшибке("К документу привязаны проводки с различной комбинацией Company, DateLawson, Reference и Currency.
				|Шапка документа заполнена не будет!", Отказ, Заголовок);
			Возврат;
		КонецЕсли;
			
	КонецЕсли;
		
	Выборка.Следующий();
				
	Если мНачалоОткрытогоУправленческогоПериода = Неопределено Тогда
		мНачалоОткрытогоУправленческогоПериода = НастройкаПравДоступа.ПолучитьНачалоОткрытогоУправленческогоПериодаМодуля(Перечисления.МодулиРазработки.PurchaseBook);
	КонецЕсли;
	
	Если мНачалоОткрытогоНалоговогоПериода = Неопределено Тогда
		мНачалоОткрытогоНалоговогоПериода = НастройкаПравДоступа.ПолучитьНачалоОткрытогоНалоговогоПериодаМодуля(Перечисления.МодулиРазработки.PurchaseBook);
	КонецЕсли;
			
	// Дата документа
	Дата = Выборка.DateLawson;
	
	// Налоговый период
	НалоговыйПериод = Дата;
	Если ЗначениеЗаполнено(мНачалоОткрытогоНалоговогоПериода)
		И НалоговыйПериод < мНачалоОткрытогоНалоговогоПериода Тогда
		НалоговыйПериод = мНачалоОткрытогоНалоговогоПериода;
	КонецЕсли;
	
	// Дата проведения
	ДатаПроведения = Дата;
	Если ЗначениеЗаполнено(мНачалоОткрытогоУправленческогоПериода)
		И ДатаПроведения < мНачалоОткрытогоУправленческогоПериода Тогда
		ДатаПроведения = мНачалоОткрытогоУправленческогоПериода;
	КонецЕсли;		
	
	// Company
	Company = Выборка.Company;
	
	// Организация
	// СДЕЛАТЬ КЕШ ОРГАНИЗАЦИЙ!!!
	Организация = ПолучениеСсылок.ПолучитьОрганизациюПоCompany(Выборка.Company);
	Если НЕ ЗначениеЗаполнено(Организация) Тогда
		ОбщегоНазначения.СообщитьОбОшибке("Не удалось определить организацию по Company " + Выборка.Company + "
			|Документ сформирован не будет!", , Заголовок);
	КонецЕсли;
		
	// Reference
	Reference = Выборка.Reference;
					
	// Валюта документа
	ВалютаДокумента = Выборка.Currency;
	ПересчитатьКурсДокумента();
			
КонецПроцедуры

Процедура ЗаполнитьТЧСуммыПоПривязаннымПроводкам(Отказ = Ложь, Заголовок=Неопределено) Экспорт
	
	Если Отказ Тогда
		Возврат;
	КонецЕсли;
	
	// Если документ новый - то к нему не может быть привязано проводок
	//	поэтому можно сразу выйти
	Если ЭтоНовый() Тогда
		Возврат;
	КонецЕсли;
	
	Если Заголовок=Неопределено Тогда
		Заголовок = "Заполнение табличной документа """ + ЭтотОбъект + """ с Reference = " + Reference + " по привязанным проводкам";
	КонецЕсли;
	
	Суммы.Очистить();
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Ссылка", Ссылка);

	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ПроводкаDSS.Company,
		|	ПроводкаDSS.DateLawson,
		|	ПроводкаDSS.Reference,
		|	ПроводкаDSS.Currency,
		|	ПроводкаDSS.TranAmount,
		|	ПроводкаDSS.ПометкаУдаления,
		|	ПроводкаDSS.ТипПроводки,
		|	ПроводкаDSS.Ваучер
		|ИЗ
		|	Документ.ПроводкаDSS КАК ПроводкаDSS
		|ГДЕ
		|	ПроводкаDSS.Документ = &Ссылка
		|	И (НЕ ПроводкаDSS.ПометкаУдаления)
		|	И ПроводкаDSS.ТипПроводки = ЗНАЧЕНИЕ(Перечисление.ТипыПроводокAPAP.CashDisbursement)";
		

		
	Результат = Запрос.Выполнить();
	Если Результат.Пустой() Тогда
		
		ОбщегоНазначения.СообщитьОбОшибке("К документу не привязано ни одной проводки типа Cash Disbursement!
			|Табличная часть заполнена не будет!", Отказ, Заголовок);
		Возврат;
			
	КонецЕсли;
	
	Выборка = Результат.Выбрать();
	Пока Выборка.Следующий() Цикл
			
		НоваяСтрокаТЧ = Суммы.Добавить();
		НоваяСтрокаТЧ.Ваучер = Выборка.Ваучер;
		НоваяСтрокаТЧ.Сумма = -Выборка.TranAmount;
				
	КонецЦикла;
	
	Суммы.Свернуть("Ваучер", "Сумма, СуммаРуб");	
	ПерезаполнитьСуммыРуб();
	
КонецПроцедуры


////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ И ФУНКЦИИ ИЗМЕНЕНИЯ РЕКВИЗИТОВ ШАПКИ ДОКУМЕНТА

Процедура ПересчитатьКурсДокумента() Экспорт
	
	Если НЕ ЗначениеЗаполнено(ВалютаДокумента) Тогда
		Возврат;
	КонецЕсли;
	
	Если ВалютаДокумента = мВалютаРегламентированногоУчета Тогда
		
		НовыйКурсДокумента = 1;
		
	Иначе
		
		Если НЕ ЗначениеЗаполнено(Дата) Тогда
			Возврат;
		КонецЕсли;
		
		СтруктураКурса = ОбщегоНазначения.ПолучитьКурсВалюты(ВалютаДокумента, Дата);
		НовыйКурсДокумента = СтруктураКурса.Курс / СтруктураКурса.Кратность;
		
	КонецЕсли;
	
	Если НовыйКурсДокумента <> КурсДокумента Тогда
		
		КурсДокумента = НовыйКурсДокумента;
		ПриИзмененииКурсаДокумента();
		
	КонецЕсли;
	
КонецПроцедуры

Процедура ПриИзмененииКурсаДокумента() Экспорт
	
	ПерезаполнитьСуммыРуб();
		
КонецПроцедуры


////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ И ФУНКЦИИ ИЗМЕНЕНИЯ ТАБЛИЧНОЙ ЧАСТИ "СУММЫ"

Процедура ПерезаполнитьСуммыРуб() Экспорт
	
	Для Каждого Строка Из Суммы Цикл
		
		ПерезаполнитьСуммуРубВСтрокеТЧСуммы(Строка);
		
	КонецЦикла;
	
КонецПроцедуры

Процедура ПерезаполнитьСуммуРубВСтрокеТЧСуммы(Строка) Экспорт
	
	Строка.СуммаРуб = Строка.Сумма * КурсДокумента;
	
КонецПроцедуры

Процедура ПерезаполнитьСуммуВСтрокеТЧСуммы(Строка) Экспорт
	
	Если КурсДокумента Тогда
		Строка.Сумма = Строка.СуммаРуб / КурсДокумента;
	Иначе
		Строка.Сумма = 0;
	КонецЕсли;
	
КонецПроцедуры


////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ И ФУНКЦИИ, ОБЕСПЕЧИВАЮЩИЕ ЗАПИСЬ И ПРОВЕДЕНИЕ ДОКУМЕНТА

Функция ПолучитьСуммуРасхождения()
	
	Если ЭтоНовый() Тогда
		Возврат 0;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ЕСТЬNULL(СУММА(ПроводкаDSS.TranAmount),0) КАК TranAmount
		|ИЗ
		|	Документ.ПроводкаDSS КАК ПроводкаDSS
		|ГДЕ
		|	ПроводкаDSS.Документ = &Ссылка
		|	И (НЕ ПроводкаDSS.ПометкаУдаления)";
	
	Выборка = Запрос.Выполнить().Выбрать();
	Выборка.Следующий();
			
	Возврат Выборка.TranAmount;
	
КонецФункции

Процедура ОтвязатьПроводки(Отказ)
	
	Если Отказ Тогда
		Возврат;
	КонецЕсли;
	
	// Если документ новый - к нему не может быть привязано проводок, выходим
	Если ЭтоНовый() Тогда
		Возврат;
	КонецЕсли;
	
	Заголовок = "Отвязывание проводок от документа """ + ЭтотОбъект + """";
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	Запрос.Текст =
		"ВЫБРАТЬ
		|	ПроводкаDSS.Ссылка
		|ИЗ
		|	Документ.ПроводкаDSS КАК ПроводкаDSS
		|ГДЕ
		|	ПроводкаDSS.Документ = &Ссылка
		|
		|ДЛЯ ИЗМЕНЕНИЯ
		|	Документ.ПроводкаDSS";
		
	Результат = Запрос.Выполнить();
	Если НЕ Результат.Пустой() Тогда
		
		МассивПроводок = Результат.Выгрузить().ВыгрузитьКолонку("Ссылка");
		МеханизмыКнигиПокупок.ПереброситьПроводкиКнигиПокупокНаДокумент(МассивПроводок, Документы.ОплатаКнигиПокупок.ПустаяСсылка(), Отказ, Заголовок);
		
	КонецЕсли;
	
КонецПроцедуры

Процедура ПроверитьЗаполнениеШапки(СтруктураШапкиДокумента, Отказ, Заголовок)
		
	// Укажем, что надо проверить:
	СтруктураОбязательныхПолей = Новый Структура;
	СтруктураОбязательныхПолей.Вставить("ДатаПроведения");
	СтруктураОбязательныхПолей.Вставить("НалоговыйПериод");
	СтруктураОбязательныхПолей.Вставить("Организация");
	СтруктураОбязательныхПолей.Вставить("Reference");
	СтруктураОбязательныхПолей.Вставить("ВалютаДокумента");
	СтруктураОбязательныхПолей.Вставить("КурсДокумента");
		
	// Теперь позовем общую процедуру проверки.
	ОбщегоНазначения.ПроверитьЗаполнениеШапкиДокумента(ЭтотОбъект, СтруктураОбязательныхПолей, Отказ, Заголовок, Истина, Истина);
		
	// Выполним более сложные проверки
	Если СуммаРасхождения <> 0 Тогда	
		УчетОшибокЗаполнения.ЗарегистрироватьОшибкуВТЧТипаЗаполненНеправильно(ЭтотОбъект, "Проводки DSS", 0, "Соотношение проводок", "Сумма проводок не равна нулю", "", Отказ, Истина, Заголовок);	
	КонецЕсли;
	
КонецПроцедуры // ПроверитьЗаполнениеШапки()

Процедура ПроверитьЗаполнениеТабличнойЧастиСуммы(СтруктураШапкиДокумента, Отказ, Заголовок)
	
	Если НЕ Суммы.Количество() Тогда
		ОбщегоНазначения.СообщитьОбОшибке("Не заполнена табличная часть!", Отказ, Заголовок);
		Возврат;
	КонецЕсли;
	
	СтруктураОбязательныхПолей = Новый Структура;
	СтруктураОбязательныхПолей.Вставить("Ваучер");
	СтруктураОбязательныхПолей.Вставить("Сумма");
	СтруктураОбязательныхПолей.Вставить("СуммаРуб");
		
	ОбщегоНазначения.ПроверитьЗаполнениеТабличнойЧасти(ЭтотОбъект, "Суммы", СтруктураОбязательныхПолей, Отказ, Заголовок, , Истина, Истина);
		
КонецПроцедуры

Функция СформироватьТаблицуСуммы()
	
	ТаблицаСуммы = Суммы.Выгрузить();
	ТаблицаСуммы.Свернуть("Ваучер", "Сумма, СуммаРуб"); 
	
	Возврат ТаблицаСуммы;
	
КонецФункции

Процедура ДвиженияПоРегистрам(СтруктураШапкиДокумента, ТаблицаСостав, Отказ, Заголовок);
	
	ДвиженияПоНеоплаченнымВаучерам = Движения.НеоплаченныеОстаткиПоВаучерам;
	Для Каждого Строка Из ТаблицаСостав Цикл
		
		Движение = ДвиженияПоНеоплаченнымВаучерам.Добавить();
		Движение.ВидДвижения = ВидДвиженияНакопления.Расход;
		Движение.Период = СтруктураШапкиДокумента.ДатаПроведения;
		Движение.Ваучер = Строка.Ваучер;
		Движение.Валюта = СтруктураШапкиДокумента.ВалютаДокумента;
		Движение.Сумма = Строка.Сумма;
		Движение.СуммаРуб = Строка.СуммаРуб;
		
	КонецЦикла;
	
	// Если валюта оплаты рубли, а валюта счета не рубли, то рассчитываем курсовую разницу и плюсуем их в НДСПредъявленный
	ВалютаРуб = Справочники.Валюты.НайтиПоКоду("643");
	Если ВалютаДокумента = ВалютаРуб И ДатаПроведения < Дата("20111001000000") Тогда // Изменил Булавский 27_11_2011 РГ-Софт
		ДвиженияПоНДСПредъявленный = Движения.НДСПредъявленный;
		Для каждого СтрокаТЧ Из ТаблицаСостав Цикл
			СчетКП = Документы.СчетКнигиПокупок.НайтиПоРеквизиту("Ваучер", СтрокаТЧ.Ваучер);
			Если НЕ СчетКП.Пустая() И ЗначениеЗаполнено(СчетКП.ВалютаДокумента) И СчетКП.ВалютаДокумента<>ВалютаРуб И СчетКП.СуммаНДСДокументаРуб<>0 Тогда
				КурсСКП = СчетКП.КурсДокумента;
				ОтборПоИзмерениям = Новый Структура;
				ОтборПоИзмерениям.Вставить("Валюта", СчетКП.ВалютаДокумента);
				КурсОКП = РегистрыСведений.КурсыВалют.ПолучитьПоследнее(ДатаПроведения, ОтборПоИзмерениям).Курс;
				СуммаВалОКП = СтрокаТЧ.СуммаРуб/КурсОКП;
				СуммаВалОКП = ?(СуммаВалОКП<СчетКП.СуммаДокументаСНДС, СуммаВалОКП, СчетКП.СуммаДокументаСНДС);
				СуммаРазницы = (КурсСКП - КурсОКП)*СуммаВалОКП;
				
				Движение = ДвиженияПоНДСПредъявленный.Добавить();
				Движение.Период = ДатаПроведения;
				Движение.ПодразделениеОрганизации = СчетКП.ПодразделениеОрганизации;
				Движение.СчетФактура = СчетКП.Ссылка;
				Движение.ВидВычета = Перечисления.ВидыНДСкВычету.КурсовыеРазницы;
				Движение.ВидЦенности = Перечисления.ВидыЦенностей.ПрочиеРаботыИУслуги;
				Движение.СтавкаНДС = ?(ЗначениеЗаполнено(СчетКП.Суммы[0].СтавкаНДС), СчетКП.Суммы[0].СтавкаНДС, Перечисления.СтавкиНДС.НДС18);
				Движение.Поставщик = СчетКП.Контрагент;
				Движение.Валюта = СчетКП.ВалютаДокумента;
				
				СуммаРазницы = -СуммаРазницы;
				Движение.НДС = УчетНДС.ОпределитьСуммуНДС(СуммаРазницы, Движение.СтавкаНДС);
				Движение.СуммаБезНДС = СуммаРазницы - Движение.НДС;
				//Движение.СуммаБезНДСВВалюте = СуммаРазницы;
				//Движение.НДСВВалюте = СуммаРазницы;
			КонецЕсли; 
		КонецЦикла; 
	КонецЕсли; 
		
КонецПроцедуры
 

////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ СОБЫТИЙ ДОКУМЕНТА

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	мУдалятьДвижения = НЕ ЭтоНовый();
	
	// Рассчитаем сумму расхождения
	ОбщегоНазначения.УстановитьЗначение(СуммаРасхождения, ПолучитьСуммуРасхождения());
	
	// Заполним реквизит Company
	ОбщегоНазначения.УстановитьЗначение(Company, ПолучениеСсылок.ПолучитьCompanyПоОрганизации(Организация));
	
	// Подкорректируем ваучеры
	Для Каждого Строка Из Суммы Цикл
		ОбщегоНазначения.УстановитьЗначение(Строка.Ваучер, СокрЛП(Строка.Ваучер));
	КонецЦикла;
	
	// Получим итоговые суммы документа
	ОбщегоНазначения.УстановитьЗначение(СуммаДокумента, Суммы.Итог("Сумма"));
	ОбщегоНазначения.УстановитьЗначение(СуммаДокументаРуб, Суммы.Итог("СуммаРуб"));
	
	Если НЕ ЗначениеЗаполнено(Ответственный) Тогда
		Ответственный = ПараметрыСеанса.ТекущийПользователь;
	КонецЕсли;
			
КонецПроцедуры

Процедура ПриЗаписи(Отказ)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	Если ПометкаУдаления Тогда
		ОтвязатьПроводки(Отказ);
	КонецЕсли;
	
КонецПроцедуры

// ПЕРЕНЕСТИ ЧАСТЬ ПРОВЕРОК В ПЕРЕД ЗАПИСЬЮ!!!
Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	
	Если мУдалятьДвижения Тогда
		ОбщегоНазначения.УдалитьДвиженияРегистратора(ЭтотОбъект, Отказ,, Истина);
	КонецЕсли;
	
	// Заголовок для сообщений об ошибках проведения.
	Заголовок = ОбщегоНазначения.ПредставлениеДокументаПриПроведении(Ссылка);
	
	// Сформируем структуру шапки документа
	СтруктураШапкиДокумента = ОбщегоНазначения.СформироватьСтруктуруШапкиДокумента(ЭтотОбъект);
		
	// Проверим правильность заполнения шапки документа
	ПроверитьЗаполнениеШапки(СтруктураШапкиДокумента, Отказ, Заголовок);
	
	// Проверим правильность заполнения табличной части "Суммы"
	ПроверитьЗаполнениеТабличнойЧастиСуммы(СтруктураШапкиДокумента, Отказ, Заголовок);
	
	// Сформируем таблицу состав
	ТаблицаСуммы = СформироватьТаблицуСуммы();
			
	Если Не Отказ Тогда
		ДвиженияПоРегистрам(СтруктураШапкиДокумента, ТаблицаСуммы, Отказ, Заголовок);
	КонецЕсли;
	
КонецПроцедуры

Процедура ОбработкаУдаленияПроведения(Отказ)
	
	ОбщегоНазначения.УдалитьДвиженияРегистратора(ЭтотОбъект, Отказ,, Истина);
	
КонецПроцедуры


мВалютаРегламентированногоУчета = Константы.ВалютаРегламентированногоУчета.Получить();
УчетОшибокЗаполнения.ИнициализироватьСтруктуруДанныхОшибокЗаполнения(ЭтотОбъект);
